Tekla.Structures.Analysis.AnalysisVolume
The AnalysisVolume class contains information related to analysis volumes.

Tekla.Structures.Analysis.AnalysisVolume._Material
The material of the analysis volume.

Tekla.Structures.Analysis.AnalysisVolume._Profile
The profile of the analysis volume.

Tekla.Structures.Analysis.AnalysisVolume._Volume
The volume item.

Tekla.Structures.Analysis.AnalysisVolume._VolumeHoles
The volume holes.

Tekla.Structures.Analysis.AnalysisVolume.Material
The material of the analysis volume.

Tekla.Structures.Analysis.AnalysisVolume.Profile
The profile of the analysis volume.

Tekla.Structures.Analysis.AnalysisVolume.Volume
The volume item.

Tekla.Structures.Analysis.AnalysisVolume.VolumeHoles
The volume holes.

Tekla.Structures.Analysis.AnalysisVolume.Select
Selects an analysis volume.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisVolume.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisVolume.CollectData
Collects additional data.